@anilkumarnagaraj yes it seems I am able to recreate consistently.

Here's the resource Terraform is trying to create (according to `terraform apply`):

```
  # ibm_satellite_location.location will be created
  + resource "ibm_satellite_location" "location" {
      + created_on           = (known after apply)
      + crn                  = (known after apply)
      + host_attached_count  = (known after apply)
      + host_available_count = (known after apply)
      + id                   = (known after apply)
      + ingress_hostname     = (known after apply)
      + ingress_secret       = (sensitive value)
      + location             = "ajf-try-sat-06231718-location"
      + managed_from         = "lon"
      + resource_group_id    = (known after apply)
      + resource_group_name  = (known after apply)
      + tags                 = (known after apply)
      + zones                = [
          + "location-zone-1",
          + "location-zone-2",
          + "location-zone-3",
        ]

      + cos_config {
          + bucket = "ajf-try-sat-06231718-location-cos-bucket"
          + region = "eu"
        }
    }
```

Here is the output I get (after about 50s):

```
ibm_satellite_location.location: Creating...
ibm_satellite_location.location: Still creating... [10s elapsed]
ibm_satellite_location.location: Still creating... [20s elapsed]
ibm_satellite_location.location: Still creating... [30s elapsed]
ibm_satellite_location.location: Still creating... [40s elapsed]
ibm_satellite_location.location: Still creating... [50s elapsed]
     "Result": {
│         "code": "E6b1d",
│         "description": "A Satellite location with the same name already exists in your account. Choose another name and try again.",
│         "incidentID": "0a202b13-14b8-4e39-8e7f-110f9fbf6526,0a202b13-14b8-4e39-8e7f-110f9fbf6526",
│         "type": "Satellite"
│     },
```

It definitely only seems to happen with London.

Here is the location it seems to have created:
```
ajf-try-sat-06231718-location                c39lujrl0650c31gg2t0   deploying         no      6 minutes ago   0 / 0                lon
```

The location *definitely* didn't exist before, I just invented that name and then ran Terraform...